package saman

import "fmt"

var errorMessages = map[int]string{
	2:  "پرداخت با موفقیت انجام شد",
	1:  "کاربر از پرداخت انصراف داده است",
	3:  "پذیرنده فروشگاهی نامعتبر است",
	4:  "کاربر در بازه زمانی تعیین شده پاسخی ارسال نکرده است",
	5:  "پارامترهای ارسالی نامعتبر است",
	8:  "آدرس سرور پذیرنده نامعتبر است",
	10: "توکن ارسال شده یافت نشد",
	11: "با این شماره ترمینال فقط تراکنش های توکنی قابل پرداخت هستند.",
	12: "شماره ترمینال ارسال شده یافت نشد",
	21: "محدودیت های مدل چند حسابی رعایت نشده",
}

var verifyAndReverseErrorMessages = map[int]string{
	-9999: "دریافت خطای استثنا",
	-9998: "دریافت تایم اوت 65 ثانیه ای",
	-106:  "آدرس آی پی درخواستی غیرمجاز می باشد.",
	-105:  "ترمینال ارسالی در سیستم موجود نمی باشد.",
	-104:  "ترمینال ارسالی غیرفعال می باشد.",
	-18:   "IP Address فروشنده نامعتبر است.",
	-14:   "چنین تراکنشی تعریف نشده است.",
	-11:   "طول ورودی ها کمتر از حد مجاز است.",
	-10:   "رسید دیجیتالی به صورت Base64 نیست.(حاوی کاراکترهای غیرمجاز است)",
	-8:    "طول ورودی ها بیشتر از حد مجاز است.",
	-7:    "رسید دیجیتال تهی است.",
	-6:    "بیش از نیم ساعت از زمان اجرای تراکنش گذشته است.",
	-2:    "تراکنش یافت نشد.",
	0:     "موفق",
	1:     "کاربر از پرداخت انصراف داده است",
	2:     "درخواست تکراری می باشد.",
	5:     "تراکنش برگشت خورده می باشد.",
}

func GetErrorMessage(code int) string {
	if errMsg, ok := errorMessages[code]; ok {
		return errMsg
	}
	return fmt.Sprintf("کد خطا: %d. خطای ناشناخته.", code)
}

func GetVerifyAndReverseErrorMessage(code int) string {
	if errMsg, ok := verifyAndReverseErrorMessages[code]; ok {
		return errMsg
	}
	return fmt.Sprintf("کد خطا: %d. خطای ناشناخته.", code)
}
